In [3]:
import pandas as pd

In [8]:
color_set_1 = pd.Series(['red','green','blue'])

In [9]:
color_set_1

0      red
1    green
2     blue
dtype: object

In [4]:
cars = pd.Series(['Honda','BMW','Tesla'])

In [5]:
cars

0    Honda
1      BMW
2    Tesla
dtype: object

In [11]:
colored_cars = pd.DataFrame({"Brand": cars, "Color": color_set_1})

In [12]:
colored_cars

   Brand  Color
0  Honda    red
1    BMW  green
2  Tesla   blue

In [13]:
Car_data = pd.read_csv("car-sales-missing-data.csv")

In [14]:
Car_data

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [21]:
Car_data.to_csv("practice_export.csv")

In [22]:
practice_export = pd.read_csv("practice_export.csv")

In [23]:
practice_export

   Unnamed: 0    Make Colour  Odometer  Doors    Price
0           0  Toyota  White  150043.0    4.0   $4,000
1           1   Honda    Red   87899.0    4.0   $5,000
2           2  Toyota   Blue       NaN    3.0   $7,000
3           3     BMW  Black   11179.0    5.0  $22,000
4           4  Nissan  White  213095.0    4.0   $3,500
5           5  Toyota  Green       NaN    4.0   $4,500
6           6   Honda    NaN       NaN    4.0   $7,500
7           7   Honda   Blue       NaN    4.0      NaN
8           8  Toyota  White   60000.0    NaN      NaN
9           9     NaN  White   31600.0    4.0   $9,700

In [24]:
Car_data.describe()

            Odometer  Doors
count       6.000000    9.0
mean    92302.666667    4.0
std     76489.805168    0.5
min     11179.000000    3.0
25%     38700.000000    4.0
50%     73949.500000    4.0
75%    134507.000000    4.0
max    213095.000000    5.0

In [26]:
Car_data.dtypes

Make         object
Colour       object
Odometer    float64
Doors       float64
Price        object
dtype: object

In [27]:
Car_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Make      9 non-null      object
 1   Colour    9 non-null      object
 2   Odometer  6 non-null      float64
 3   Doors     9 non-null      float64
 4   Price     8 non-null      object
dtypes: float64(2), object(3)
memory usage: 528.0+ bytes

In [29]:
Car_data["Doors"].mean()

4.0

In [30]:
Car_data["Odometer"].sum()

553816.0

In [33]:
Car_data.columns

Index(['Make', 'Colour', 'Odometer', 'Doors', 'Price'], dtype='object')

In [35]:
leng = Car_data.index

In [36]:
leng

RangeIndex(start=0, stop=10, step=1)

In [37]:
leng["stop"]

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [38]:
leng[stop]

NameError: name 'stop' is not defined

In [39]:
leng(stop)

NameError: name 'stop' is not defined

In [40]:
len(Car_data.index)

10

In [42]:
Car_data.shape

(10, 5)

In [45]:
Car_data.sample(5)

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
9     NaN  White   31600.0    4.0   $9,700
3     BMW  Black   11179.0    5.0  $22,000
7   Honda   Blue       NaN    4.0      NaN
1   Honda    Red   87899.0    4.0   $5,000

In [47]:
Car_data.head()

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [48]:
Car_data.tail()

     Make Colour  Odometer  Doors   Price
5  Toyota  Green       NaN    4.0  $4,500
6   Honda    NaN       NaN    4.0  $7,500
7   Honda   Blue       NaN    4.0     NaN
8  Toyota  White   60000.0    NaN     NaN
9     NaN  White   31600.0    4.0  $9,700